In [1]:
import pandas as pd

# 创建DataFrame对象

In [5]:
data = [[109, 107, 100],
        [105, 114, 135],
        [98, 88, 120],
        [145, 150, 130]]
name = ['刘备', '关羽', '张飞', '诸葛亮']
columns = ['语文', '数学', '英语']
df = pd.DataFrame(
    data=data,
    index=name,
    columns=columns)
df

      语文   数学   英语
刘备   109  107  100
关羽   105  114  135
张飞    98   88  120
诸葛亮  145  150  130

# 新增数据

## 按列新增数据

### 直接赋值
- 在最后插入“物理”一列

In [4]:
df['物理'] = [80, 80, 70, 60]
df

      语文   数学   英语  物理
刘备   109  107  100  80
关羽   105  114  135  80
张飞    98   88  120  70
诸葛亮  145  150  130  60

### loc方法
- 在最后插入“物理”一列

In [8]:
df.loc[:, '物理'] = [80, 80, 70, 60]
df

      语文   数学   英语  物理
刘备   109  107  100  80
关羽   105  114  135  80
张飞    98   88  120  70
诸葛亮  145  150  130  60

### insert方法
- 在第1列后面插入“物理”列名

In [9]:
del df['物理']
df

      语文   数学   英语
刘备   109  107  100
关羽   105  114  135
张飞    98   88  120
诸葛亮  145  150  130

In [10]:
df.insert(1, '物理', [80, 80, 70, 60])
df

      语文  物理   数学   英语
刘备   109  80  107  100
关羽   105  80  114  135
张飞    98  70   88  120
诸葛亮  145  60  150  130

## 按行新增数据

### 新增一行数据

In [11]:
df.loc['赵云'] = [100, 120, 100, 95]
df

      语文   物理   数学   英语
刘备   109   80  107  100
关羽   105   80  114  135
张飞    98   70   88  120
诸葛亮  145   60  150  130
赵云   100  120  100   95

### 新增多行数据

In [13]:
df2 = pd.DataFrame(
    {'语文': [100, 123, 138],
     '数学': [120, 142, 60],
     '英语': [99, 139, 99],
     '物理': [105, 110, 96]},
    index=['马超', '黄忠', '姜维'])
df2

     语文   数学   英语   物理
马超  100  120   99  105
黄忠  123  142  139  110
姜维  138   60   99   96

In [14]:
df3 = df.append(df2)
df3

      语文   物理   数学   英语
刘备   109   80  107  100
关羽   105   80  114  135
张飞    98   70   88  120
诸葛亮  145   60  150  130
赵云   100  120  100   95
马超   100  105  120   99
黄忠   123  110  142  139
姜维   138   96   60   99

# 修改行列索引

## 修改列索引

### 通过属性赋值

In [17]:
df.columns = ['语文', '物理(上)', '数学', '英语']

In [24]:
df.columns = ['语文', '物理', '数学', '英语']

### 通过rename方法

In [26]:
df.rename(mapper={'物理': '物理(上)'}, axis=1, inplace=True)
# df.rename(columns={'物理': '物理(上)'}, inplace=True)
# df = df.rename(columns={'物理': '物理(上)'})
df

      语文  物理(上)   数学   英语
刘备   109     80  107  100
关羽   105     80  114  135
张飞    98     70   88  120
诸葛亮  145     60  150  130
赵云   100    120  100   95

## 修改行索引

### 通过属性赋值

In [28]:
df.index = [1, 2, 3, 4, 5]

In [32]:
df.index = ['刘备', '关羽', '张飞', '诸葛亮', '赵云']

### 通过rename方法

In [33]:
# df.rename(
#     mapper={'刘备': '大哥', '关羽': '二哥', '张飞': '三弟'},
#     axis=0, inplace=True)
df = df.rename(index={'刘备': '大哥', '关羽': '二哥', '张飞': '三弟'})
df

      语文  物理(上)   数学   英语
大哥   109     80  107  100
二哥   105     80  114  135
三弟    98     70   88  120
诸葛亮  145     60  150  130
赵云   100    120  100   95

In [36]:
df.index = ['刘备', '关羽', '张飞', '诸葛亮', '赵云']

In [37]:
df.columns = ['语文', '物理', '数学', '英语']

# 修改数据

In [38]:
df

      语文   物理   数学   英语
刘备   109   80  107  100
关羽   105   80  114  135
张飞    98   70   88  120
诸葛亮  145   60  150  130
赵云   100  120  100   95

## 修改整行数据

In [40]:
df.loc['张飞'] = [98, 80, 85, 100]
df

      语文   物理   数学   英语
刘备   109   80  107  100
关羽   105   80  114  135
张飞    98   80   85  100
诸葛亮  145   60  150  130
赵云   100  120  100   95

## 修改整列数据

In [41]:
df.loc[:, '英语'] = [120, 110, 90, 100, 112]
df

      语文   物理   数学   英语
刘备   109   80  107  120
关羽   105   80  114  110
张飞    98   80   85   90
诸葛亮  145   60  150  100
赵云   100  120  100  112

## 修改张飞的各科成绩
- 各科均加10分

In [43]:
df.loc['张飞'] = df.loc['张飞'] + 10
df

      语文   物理   数学   英语
刘备   109   80  107  120
关羽   105   80  114  110
张飞   108   90   95  100
诸葛亮  145   60  150  100
赵云   100  120  100  112

## 修改张飞的语文成绩

In [44]:
df.loc['张飞', '语文'] = 110
df

      语文   物理   数学   英语
刘备   109   80  107  120
关羽   105   80  114  110
张飞   110   90   95  100
诸葛亮  145   60  150  100
赵云   100  120  100  112

## 修改第1行第1列数据
- 使用iloc方法

In [46]:
df.iloc[0, 0] = 120
df

      语文   物理   数学   英语
刘备   120   80  107  120
关羽   105   80  114  110
张飞   110   90   95  100
诸葛亮  145   60  150  100
赵云   100  120  100  112

## 修改整列数据，第1列
- 使用iloc方法

In [47]:
df.iloc[:, 0] = [115, 106, 113, 120, 120]
df

      语文   物理   数学   英语
刘备   115   80  107  120
关羽   106   80  114  110
张飞   113   90   95  100
诸葛亮  120   60  150  100
赵云   120  120  100  112

## 修改整行数据，第1行
- 使用iloc方法

In [49]:
df.iloc[0] = [116, 90, 110, 115]
df

      语文   物理   数学   英语
刘备   116   90  110  115
关羽   106   80  114  110
张飞   113   90   95  100
诸葛亮  120   60  150  100
赵云   120  120  100  112

# 删除数据

## 删除列数据
- 传输列表，则删除多列

In [50]:
df.drop(columns='数学', inplace=True)
# df.drop(labels='数学', axis=1, inplace=True)
# df = df.drop(columns='数学')
df

      语文   物理   英语
刘备   116   90  115
关羽   106   80  110
张飞   113   90  100
诸葛亮  120   60  100
赵云   120  120  112

## 删除行数据
- 传输列表，则删除多行

In [51]:
df.drop(index='张飞', inplace=True)
# df.drop(labels='张飞', axis=0, inplace=True)
# df = df.drop(index='张飞')
df

      语文   物理   英语
刘备   116   90  115
关羽   106   80  110
诸葛亮  120   60  100
赵云   120  120  112

## 删除指定条件的行

### 删除“物理”等于60或80的行

In [56]:
index = df[(df['物理'] == 60) | (df['物理'] == 80)].index
# index = df[df['物理'].isin([60, 80])].index
df.drop(index=index, inplace=True)
df

     语文   物理   英语
刘备  116   90  115
赵云  120  120  112

### 删除“语文”小于120的行

In [60]:
index = df[df['语文'] < 120].index
df.drop(index=index, inplace=True)

In [61]:
df

     语文   物理   英语
赵云  120  120  112